src/test/resources/soap-operation/soap-request-signed-new-token-break.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
          xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
          soapenv:mustUnderstand="1">
            <wsse:BinarySecurityToken
              EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary"
              ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"
              wsu:Id="X509-74f99e73-e78c-4f7f-88f9-777ac064bcde">
                MIIDbTCCAlWgAwIBAgIIZbCkVdky9JgwDQYJKoZIhvcNAQEMBQAwZTELMAkGA1UEBhMCVVMxETAP&#13;
BgNVBAgTCE5ldyBZb3JrMREwDwYDVQQHEwhOZXcgWW9yazENMAsGA1UEChMESG9tZTENMAsGA1UE&#13;
CxMESG9tZTESMBAGA1UEAxMJbG9jYWxob3N0MB4XDTI0MTIzMDE3MjUzOVoXDTI1MDMzMDE3MjUz&#13;
OVowZTELMAkGA1UEBhMCVVMxETAPBgNVBAgTCE5ldyBZb3JrMREwDwYDVQQHEwhOZXcgWW9yazEN&#13;
MAsGA1UEChMESG9tZTENMAsGA1UECxMESG9tZTESMBAGA1UEAxMJbG9jYWxob3N0MIIBIjANBgkq&#13;
                hkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAxCyRXxU2A+vXN+Gq9AY4pT4PznnWqsttEwQZ91QNhnGR&#13;
                Gv9K5vG/o+NU5k1jDXuophjiihSkm7K6f6ArDz8ppIYSZekULyMuYWQUMnGI5BW7pPLFiJuMZvYE&#13;
                /Qlf6BEH4Qnn70uiJcWUTRIz7pW76f83pgrcVZtAcpu8iSsLtTOcMwaPgMlsE1KQX7au1CCdnXyT&#13;
                of2Agfdtm6t2nca7EgAv+UlsEDTGNEoipYDz6Wfi0sDmmNpqayhaNl5+6YVL7XSu1S5X8Jfwplxs&#13;
                noAVvx/puim8s7zVWrsKJKZftm3AEOGpcrXBSoU2zh+HjHJaME+/1sEiwmvfs0UCrKo3JQIDAQAB&#13;
                oyEwHzAdBgNVHQ4EFgQUKh8+49+oWdPbDTp7CuCWjeO2jYgwDQYJKoZIhvcNAQEMBQADggEBAG6T&#13;
                h0u58OJ9km+r9lx7rTN+8ZhzDPajb5GmMzIWiCuiaiYSljNX3CRlhllU/Zi1LQyKRiCSmn2GD1Kc&#13;
                LVF40+F3hzg3d1I9u+UGq8PWgQqS76+Q4fX9uucOqqSlD6CNGPmIIA0JnMPZ8pFlYVvhR2GzL+ao&#13;
                itxvXgScGOjsRk1CHU5+Kow33/6Q/kzY9DRBP92TE28cD7CwGUZAQtg+rt7xH/O2cImwgTjhn99o&#13;
                Te27VENA699M6cKIkCkhOWFbwJHcWmTW3zk63+jZe0BAZWfHlg6pivoiCH87wgd9QKQUxdAOTsAv&#13;
                Bn4JbmdtBekVJVvgWRjlh3bOg+iAsortUUk=
            </wsse:BinarySecurityToken>
            <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="SIG-873b5dcb-d319-4916-9690-18c6326074b8">
                <ds:SignedInfo>
                    <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                        <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"
                          PrefixList="gs soapenv"/>
                    </ds:CanonicalizationMethod>
                    <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                    <ds:Reference URI="#id-39c00412-7e8e-4c23-b366-4dd791b18a76">
                        <ds:Transforms>
                            <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                                <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"
                                  PrefixList="gs"/>
                            </ds:Transform>
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <ds:DigestValue>uyYmrCcDg1DYPwXa8qB85mzaeII=</ds:DigestValue>
                    </ds:Reference>
                </ds:SignedInfo>
                <ds:SignatureValue>
                    us45LTm7m+tl1K5B5RNjEpx992HvEodgi+ixDZVPSiNvbZveokZ3fXfqntn8dx7kA2ItsIQm1xIsLALOPd4RbvHLUThowH20xoJetmY7sYfIud3ZG7vAnw9SrXJbLU1rB8R+3t7NaWtlqUxz58fs4HJQzxtSWxT3Tg2yC159Im0w4i0bP0VFvaqcWbBaGh2JuiVlQ14+grO2daQ+jFmKcguQiV3tYoWBviZEf33aijwims+In4OGvfx0l1Y/RatuCS0gzhhSsMGaLXAmQ7NX5g9QWt6xJMeqYGyXA7Rzrmv2Sg0SwbICWTpUL+7WedhpU0ZPpzdvW/5pRjch/wpdYw==
                </ds:SignatureValue>
                <ds:KeyInfo Id="KI-4bd3a80b-dcd1-4476-ad66-a27c15f0a81e">
                    <wsse:SecurityTokenReference wsu:Id="STR-b39e60c5-511b-4acb-a749-ce39b1b0e63a">
                        <wsse:Reference URI="#X509-74f99e73-e78c-4f7f-88f9-777ac064bcde"
                          ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/>
                    </wsse:SecurityTokenReference>
                </ds:KeyInfo>
            </ds:Signature>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
      wsu:Id="id-39c00412-7e8e-4c23-b366-4dd791b18a76">
        <gs:getCountryRequest>
            <gs:name>Spain</gs:name>
        </gs:getCountryRequest>
    </soapenv:Body>
</soapenv:Envelope>