sample_request.xml

<soap:Envelope xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/'>
  <soap:Body>
    <sch:getCountryRequest xmlns:sch='http://spring.io/guides/gs-producing-web-service'>
      <sch:name>Spain</sch:name>
    </sch:getCountryRequest>
  </soap:Body>
</soap:Envelope>
